START_COMMAND = """🔻فرمت درخواست به شکل زیر می‌باشد. در صورتی که ترم آخر هستید، به صورت جداگانه به ادمین اطلاع دهید.

نام و نام خانوادگی + شماره دانشجویی + نام درس + کد ارائه

نیاز به راهنمایی /help

@mob_gh"""

HELP_COMMAND = "temporary disabled"

INCORRECT_LENGTH = " ❌ لطفا درخواست خود را طبق فرمت گفته شده ارسال کنید "

INCORRECT_USERNAME = "❗️ لطفا نام و نام خانوادگی خود را به درستی وارد کنید "

INCORRECT_STUDENT_ID = "❗️ لطفا شماره دانشجویی خود را به درستی وارد کنید "

INCORRECT_COURSE = "❗️ لطفا نام درس را به درستی وارد کنید "

INCORRECT_COURSE_ID = "❗️ لطفا کد ارائه درس را به درستی وارد کنید "

RECEIVED_REQUEST = " درخواست شما دریافت شد ✅ "
