# Home
START_COMMAND = """🔻قابل توجه دانشجویان :

لطفا قبل از استفاده از ابزار های ربات، فایل راهنمای استفاده از آن (تصویر بالا) را مطالعه نمایید.
"""

# Request course
REQUEST_COMMAND = """🔻فرمت درخواست افزایش ظرفیت به شکل زیر می‌باشد. (نمونه در تصویر بالا)

نام و نام خانوادگی + شماره دانشجویی + نام درس + کد ارائه


❗️توجه : در صورتی که ترم آخر هستید لطفا پس از ارسال درخواست، مشخصات خود را به صورت جداگانه برای ادمین ارسال کنید :
@mob_gh"""

REQUEST_INCORRECT_LENGTH = " ❌ لطفا درخواست خود را طبق فرمت گفته شده ارسال کنید "
REQUEST_INCORRECT_USERNAME = "❗️ لطفا نام و نام خانوادگی خود را به درستی وارد کنید "
REQUEST_INCORRECT_STUDENT_ID = "❗️ لطفا شماره دانشجویی خود را به درستی وارد کنید "
REQUEST_INCORRECT_COURSE = "❗️ لطفا نام درس را به درستی وارد کنید "
REQUEST_INCORRECT_COURSE_ID = "❗️ لطفا کد ارائه درس را به درستی وارد کنید "
REQUEST_RECEIVED_REQUEST = " درخواست شما دریافت شد ✅ "

# Convert name
CONVERT_NAME_COMMAND = """🔻جهت تبدیل نام درس کافیست پس از عبارت تبدیل، نام درس مورد نظر خود را وارد کنید :

تبدیل نام درس مورد نظر
"""

# Chart
CHART_SELECT_ORIENT = """💠 نحوه تعیین #گرایش رشته مهندسی کامپیوتر

🔹گرایش دانشجویان ورودی 95 به بعد در زمان ثبت نام مشخص نمی‌باشد، لذا تعیین گرایش دانشجو با توجه به اولین درس تخصصی انجام خواهد شد. در صورت عدم رعایت این مورد، دانشجو در زمان فارغ التحصیلی با مشکل مواجه خواهد شد.

🔹دو #گرایش نرم افزار و فناوری اطلاعات در 7 درس سه واحدی تفاوت دارند که این دروس را از فایل لیست دروس گرایش مورد نظر قابل مشاهده می‌باشد. (جدول دروس تخصصی)

📌 تاکید می‌گردد که اخذ درس سه واحدی از گرایش مخالف به عنوان واحد #اختیاری، تنها پس از مشخص شدن گرایش دانشجو و اخذ اولین درس تخصصی از آن گرایش امکان پذیر خواهد بود.

<a href="https://t.me/ceiaun">کانال دانشجویان مقطع کارشناسی کامپیوتر</a>
@ceiaun"""

CHART_SE_CAPTION = """📌 لیست دروس و چارت پیشنهادی رشته مهندسی کامیپوتر - گرایش نرم افزار

پیش نیاز دروس از هر دو فایل بررسی شود.

<a href="https://t.me/ceiaun">کانال دانشجویان مقطع کارشناسی کامپیوتر</a>
@ceiaun"""

CHART_IT_CAPTION = """📌 لیست دروس و #چارت پیشنهادی رشته مهندسی کامیپوتر - #گرایش فناوری اطلاعات (IT)

پیش نیاز دروس از هر دو فایل بررسی شود.

<a href="https://t.me/ceiaun">کانال دانشجویان مقطع کارشناسی کامپیوتر</a>
@ceiaun"""

# Help
HELP_COMMAND = "temporary disabled"
