START_COMMAND = """خوش آمدید (موقت)
"""

REQUEST_COMMAND = """🔻فرمت درخواست افزایش ظرفیت به شکل زیر می‌باشد. (نمونه در تصویر بالا)

نام و نام خانوادگی + شماره دانشجویی + نام درس + کد ارائه


❗️توجه : در صورتی که ترم آخر هستید لطفا پس از ارسال درخواست، مشخصات خود را به صورت جداگانه برای ادمین ارسال کنید :
@mob_gh"""

CONVERT_NAME_COMMAND = """🔻جهت تبدیل نام درس کافیست پس از عبارت تبدیل، نام درس مورد نظر خود را وارد کنید :

تبدیل نام درس مورد نظر
"""


HELP_COMMAND = "temporary disabled"

INCORRECT_LENGTH = " ❌ لطفا درخواست خود را طبق فرمت گفته شده ارسال کنید "

INCORRECT_USERNAME = "❗️ لطفا نام و نام خانوادگی خود را به درستی وارد کنید "

INCORRECT_STUDENT_ID = "❗️ لطفا شماره دانشجویی خود را به درستی وارد کنید "

INCORRECT_COURSE = "❗️ لطفا نام درس را به درستی وارد کنید "

INCORRECT_COURSE_ID = "❗️ لطفا کد ارائه درس را به درستی وارد کنید "

RECEIVED_REQUEST = " درخواست شما دریافت شد ✅ "

